Revit 2027 API
ElectricalAnalyticalLoadSet.GetLoadIds Method
 Gets Equipment Load ids in the LoadSet.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetLoadIds()
Public Function GetLoadIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetLoadIds()
member GetLoadIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The Equipment Load ids.
See Also
Reference
ElectricalAnalyticalLoadSet Class
Autodesk.Revit.DB.Electrical Namespace